<?php

use akiyatkin\dabudi\Model;
use infrajs\ans\Ans;

$ans = array();

$pos = array(
	'itemrows'=>['Цена','Файлы','Размер', 'Цвет'], 
	'Цена' => 1000, 'Файлы' => false, 
	'more'=>array(
		'Размер'=>'X', 'Цвет'=>'red'
	)
);

/*
Некоторые свойства идетифицируют, а некоторые описывают, но меняются все от позиции к позиции.
Любые из переменных свойст могут быть идентифицирующими. Это субьективный "как принято".
Дайте лампу за 200 руб. - пожалуйста, вот лампа 100 Вт.
Дайте лампу 75 ват. - пожайлуйста, с вас 150 руб.
Выбирать надо те свойства, связь со значениями, которых не поменяются в течением времени.
Например у нас есть 1. фотография, 2. производитель 3. артикул 4. цена 5. наличие 6 размер, 7 цвет
1 и будет всегда для 2 и 3. мы не можем изменить 2 и сохранить 3. То есть 1=2=3 размер(6) можем менять и зависимости от него будет цена. Может быть так что цена определяеть этот размер, этого цвета. Фото может меняться, но фотография цвета и размера не делает новый объект. А новый размер создаёт новый объект. И хотя у каждого объекта своё фото, само по себе фото не создаётновый объект.

Берём реальный объект - Лампа. Меняем ваты и объект меняется - то есть это уже другая лампа.
Меняем цену и объект тот же самый. Делаем новое фото и объект тот же самый.

Одни свойства создают новый объект, другие описывают существующий.
Могут быть позиции для которых не достаёт данных
RVi D23 - 1000 руб.
RVi D23 - 1500 руб.
и потом мы узнаём
RVi D23 - 1000 руб. процессор 1 MHz
RVi D23 - 1500 руб. процессор 2 MHz
В данных каждая строка обязательно содержит все свойства необходимые для идентификации позиции и общего описания модели или текущей позиции.

Модель это строго Производитель Артикул. 

Какие из меняющихся параметров определяют новые объекты=позиции - содержится в конфиге это конечный список, при условии что будут найдены разные значения параметров одной модели. 

Описательные парамеры: Цена, Файлы, Наименование, 
Идентифицирующие: Цвет, Размер, Частота

Если встречается расхождение в описательном параметре при одинаковых идентифицирующих это признак того что описательный параметр страновится идентифицирующим. Но расхождение может быть сразу в двух параметрах и нужно знать какой из них использовать в качестве id нового объекта или оба.

Описательные парамеры - все которые известные. Если в more расхождение значит идентифицирующий?

Стол Кух5 VIP Дуб
Стол Кух5 ECO Сосна

*/



$id = Model::getId($pos);
if ($id !== 'X-red') return Ans::err($ans, 'Model::getId неожиданный результат');
return Ans::ret($ans);